"""
1961. 숫자 배열 회전

    · 시간 : 10개 테스트케이스를 합쳐서 C++의 경우 30초 / Java의 경우 30초 / Python의 경우 30초
    · 메모리 : 힙, 정적 메모리 합쳐서 256MB 이내, 스택 메모리 1MB 이내


    N x N 행렬이 주어질 때,
    시계 방향으로 90도, 180도, 270도 회전한 모양을 출력하라.

    [제약 사항]
        N은 3 이상 7 이하이다.

    [입력]
        가장 첫 줄에는 테스트 케이스의 개수 T가 주어지고, 그 아래로 각 테스트 케이스가 주어진다.
        각 테스트 케이스의 첫 번째 줄에 N이 주어지고,
        다음 N 줄에는 N x N 행렬이 주어진다.

    [출력]
        출력의 첫 줄은 '#t'로 시작하고,
        다음 N줄에 걸쳐서 90도, 180도, 270도 회전한 모양을 출력한다.
        입력과는 달리 출력에서는 회전한 모양 사이에만 공백이 존재함에 유의하라.
        (t는 테스트 케이스의 번호를 의미하며 1부터 시작한다.)


    입력
        10
        3
        1 2 3
        4 5 6
        7 8 9
        6
        6 9 4 7 0 5
        8 9 9 2 6 5
        6 8 5 4 9 8
        2 2 7 7 8 4
        7 5 1 9 7 9
        8 9 3 9 7 6
        7
        9 3 1 8 5 0 5
        1 1 1 7 9 1 8
        3 6 1 4 7 7 4
        3 1 8 5 3 0 7
        2 5 2 5 7 6 8
        2 8 5 2 6 7 0
        0 5 5 9 3 6 0
        3
        6 0 4
        7 9 3
        8 1 2
        6
        1 6 4 0 8 1
        0 8 0 4 1 2
        7 7 6 8 4 3
        8 6 3 8 0 0
        5 7 7 7 6 4
        9 1 8 1 7 1
        3
        4 1 9
        9 9 7
        8 0 1
        5
        1 0 2 2 7
        5 2 4 8 5
        4 7 8 2 3
        9 6 2 8 5
        9 6 1 6 6
        3
        4 8 3
        4 6 3
        3 9 6
        3
        4 9 7
        0 1 3
        4 4 3
        5
        1 1 7 4 1
        0 7 9 3 5
        5 2 5 8 6
        6 1 9 0 6
        7 0 1 3 9

    출력
        #1
        741 987 369
        852 654 258
        963 321 147
        #2
        872686 679398 558496
        952899 979157 069877
        317594 487722 724799
        997427 894586 495713
        778960 562998 998259
        694855 507496 686278
        #3
        0223319 0639550 5847800
        5851613 0762582 0170676
        5528111 8675252 5973763
        9255478 7035813 8745529
        3673795 4774163 1118255
        6760710 8197111 3161585
        0087485 5058139 9133220
        #4
        876 218 432
        190 397 091
        234 406 678
        #5
        958701 171819 123041
        176786 467775 814067
        873604 008368 048871
        178840 348677 406378
        760418 214080 687671
        140321 180461 107859
        #6
        894 108 971
        091 799 190
        179 914 498
        #7
        99451 66169 75356
        66720 58269 28286
        12842 32874 24821
        68282 58425 02766
        65357 72201 15499
        #8
        344 693 336
        968 364 869
        633 384 443
        #9
        404 344 733
        419 310 914
        337 794 404
        #10
        76501 93107 15669
        01271 60916 43803
        19597 68525 79591
        30834 53970 17210
        96651 14711 10567
"""


# 실행 시간 : 0.15983s
# Pass

def turn_90(first):
    second = [[] * N for _ in range(N)]

    for s in range(N):
        for f in range(N):
            second[s].append(first[(N - 1) - f][s])

    return second


T = int(input())

for t in range(1, T + 1):
    N = int(input())

    square = [[0] * N for _ in range(N)]

    for n in range(N):
        square[n] = list(input().split())

    result = [[0] * 3 for _ in range(N)]
    result_90 = turn_90(square)
    result_180 = turn_90(result_90)
    result_270 = turn_90(result_180)

    # 전체 결과 리스트에 각 회전 결과 리스트 대입
    for r in range(N):
        result[r][0] = result_90[r]
        result[r][1] = result_180[r]
        result[r][2] = result_270[r]

    print("#%d" % t)
    for p in range(N):
        for c in range(3):
            if c == 2:
                print("".join(result[p][c]))
            else:
                print("".join(result[p][c]), end=' ')
